================== layer 1 ====================
CS(layer1@0)
  {
    "a": 1,
    "b": 2,
    "c": {
      "a": 3,
      "b": 4
    },
    "d": {
      "a": 1,
      "b": 2,
      "c": {
        "a": 1,
        "b": {
          "a": 1,
          "b": {
            "a": 2
          }
        }
      }
    },
    "e": {
      "a": {
        "a": 1,
        "b": 2
      },
      "b": 1
    }
  }
================== layer 2 ====================
CS(layer2@0, CS(layer1@0))
  {
    "a": 2,
    "c": {
      "c": 5
    },
    "+d": {
      "a": 2,
      "+c": {
        "a": 9,
        "f": 10
      },
      "e": 3
    },
    "e": {
      "+a": {
        "c": 3
      }
    }
  }
=================== layer1.a
1
=================== layer1.b
2
=================== layer1.c
{"a":3,"b":4}
=================== layer1.c.a
3
=================== layer2.a
2
=================== layer2.b
2
=================== layer2.c
{"c":5}
=================== layer2.c.a
nil
=================== layer2.c.c
5
=================== layer2.d
{"a":2,"b":2,"c":{"a":9,"b":{"a":1,"b":{"a":2}},"f":10},"e":3}
=================== layer2.d.a
2
=================== layer2.d.b
2
=================== layer2.d.e
3
=================== layer2.d.c
{"a":9,"b":{"a":1,"b":{"a":2}},"f":10}
=================== layer2.d.c.a
9
=================== layer2.d.c.b
{"a":1,"b":{"a":2}}
=================== layer2.d.c.f
10
=================== layer1.e
{"a":{"a":1,"b":2},"b":1}
=================== layer1.e.a
{"a":1,"b":2}
=================== layer1.e.b
1
=================== layer2.e
{"+a":{"c":3}}
=================== layer2.e.a
{"c":3}
=================== layer2.e.b
nil
================== layer 1 ====================
CS(layer1@1)
  {
    "a": 3,
    "b": 2,
    "c": {
      "a": 3,
      "b": 4
    },
    "d": {
      "a": 1,
      "b": 2,
      "c": {
        "a": 1,
        "b": {
          "a": 1,
          "b": {
            "a": 2
          }
        }
      }
    },
    "e": {
      "a": {
        "a": 1,
        "b": 2
      },
      "b": 1
    }
  }
=================== layer1.a
3
=================== layer2.a
2
=================== setting layer2.d.c.f
--- testSetting CS(layer2@0, CS(layer1@1)).d.c.f, cache: none(JsonNodeEx), layers: @[]
10
new layers: @[(0, Extend, "CS(layer2@0, CS(layer1@1))"), (1, Override, "CS(layer1@1)")]
--- testSetting CS(layer2@0, CS(layer1@1)).d.c.f, cache: some(10), layers: @[(0, Extend, "CS(layer2@0, CS(layer1@1))"), (1, Override, "CS(layer1@1)")]
10
new layers: @[(0, Extend, "CS(layer2@0, CS(layer1@1))"), (1, Override, "CS(layer1@1)")]
--- testSetting CS(layer2@1, CS(layer1@1)).d.c.f, cache: some(10), layers: @[(0, Extend, "CS(layer2@1, CS(layer1@1))"), (1, Override, "CS(layer1@1)")]
113
new layers: @[(1, Extend, "CS(layer2@1, CS(layer1@1))"), (1, Override, "CS(layer1@1)")]
--- testSetting CS(layer2@1, CS(layer1@1)).d.c.f, cache: some(113), layers: @[(1, Extend, "CS(layer2@1, CS(layer1@1))"), (1, Override, "CS(layer1@1)")]
113
new layers: @[(1, Extend, "CS(layer2@1, CS(layer1@1))"), (1, Override, "CS(layer1@1)")]
=================== setting layer2.a
--- testSetting CS(layer2@1, CS(layer1@1)).a, cache: none(JsonNodeEx), layers: @[]
2
new layers: @[(1, Override, "CS(layer2@1, CS(layer1@1))")]
--- testSetting CS(layer2@1, CS(layer1@1)).a, cache: some(2), layers: @[(1, Override, "CS(layer2@1, CS(layer1@1))")]
2
new layers: @[(1, Override, "CS(layer2@1, CS(layer1@1))")]
--- testSetting CS(layer2@1, CS(layer1@2)).a, cache: some(2), layers: @[(1, Override, "CS(layer2@1, CS(layer1@2))")]
2
new layers: @[(1, Override, "CS(layer2@1, CS(layer1@2))")]
--- testSetting CS(layer2@1, CS(layer1@2)).a, cache: some(2), layers: @[(1, Override, "CS(layer2@1, CS(layer1@2))")]
2
new layers: @[(1, Override, "CS(layer2@1, CS(layer1@2))")]
=================== setting layer2.a
--- testSetting CS(layer2@1, CS(layer1@2)).a, cache: none(JsonNodeEx), layers: @[]
2
new layers: @[(1, Override, "CS(layer2@1, CS(layer1@2))")]
--- testSetting CS(layer2@1, CS(layer1@2)).a, cache: some(2), layers: @[(1, Override, "CS(layer2@1, CS(layer1@2))")]
2
new layers: @[(1, Override, "CS(layer2@1, CS(layer1@2))")]
--- testSetting CS(layer2@2, CS(layer1@2)).a, cache: some(2), layers: @[(1, Override, "CS(layer2@2, CS(layer1@2))")]
113
new layers: @[(2, Override, "CS(layer2@2, CS(layer1@2))")]
--- testSetting CS(layer2@2, CS(layer1@2)).a, cache: some(113), layers: @[(2, Override, "CS(layer2@2, CS(layer1@2))")]
113
new layers: @[(2, Override, "CS(layer2@2, CS(layer1@2))")]
